GetChangeTypeElementDeletion Method
 Returns ChangeType associated with element deletion.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static ChangeType GetChangeTypeElementDeletion()
  Visual Basic
Public Shared Function GetChangeTypeElementDeletion As ChangeType
  Visual C++
public:
static ChangeType^ GetChangeTypeElementDeletion()
 Return Value
 ChangeType that can be used to define a trigger for an Updater, triggering on element deletion.
 Remarks
 ChangeType that can be used to define a trigger for an Updater, Use this change type to trigger an Updater on the deletion of elements from a document. Note: This change type will not trigger on changes caused by Undo and Redo.
 See Also
  Element Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →